app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "email"]]
SELECT  "users".* FROM "users" WHERE "users"."referral_code" = ? LIMIT 1  [["referral_code", "e2da635528"]]
INSERT INTO "users" ("email", "username", "created_at", "updated_at", "referral_code") VALUES (?, ?, ?, ?, ?)  [["email", "test@testme.com"], ["username", "The tester"], ["created_at", "2015-03-28 14:55:48.770422"], ["updated_at", "2015-03-28 14:55:48.770422"], ["referral_code", "e2da635528"]]
---
	def create
		#find a User with the same email
		@user = User.find_by_email(:email)

		#if User does not exist
		if @user.nil?
			#create a new instance of User with email
			@user = User.new(user_params)

			#get the User with the same referral code as in the cookies hash
			@referred_by = User.find_by_referral_code(cookies[:h_ref])

			#if User found, set current User's referrer
			if !@referred_by.nil?
				@user.referrer = @referred_by
			end

			#save instance of current user
			@user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "test@testme.com"]]
---
	def refer
		#retreive the current User's email from the cookies hash
		email = cookies[:h_email]

		#retreive current User
		@user = User.find_by_email(email)

SELECT "users".* FROM "users"
---
	def leaders
		@users = User.all